/*********************************************************************
	微 雪 电 子   WaveShare   http://www.waveShare.net            	
		                                                            
目    的:   建立操作LCD12864_ST7920液晶的示例程序

目标系统:   基于任何AVR单片机
		                                                                
应用软件:   ICCAVR
		                                                                
版    本:   Version 1.0                                                          
		                                                                
圆版时间:   2005-06-25
	
开发人员:   SEE

说    明:   若用于商业用途，请保留此段文字或注明代码来源
	
	深 圳 市 微 雪 电 子 有 限 公 司 保 留 所 有 的 版 权
*********************************************************************/

/*01010101010101010101010101010101010101010101010101010101010101010101
----------------------------------------------------------------------
版本更新记录：

----------------------------------------------------------------------
实验内容：
初始化、读写Lcd12864_ST7920。
----------------------------------------------------------------------
硬件连接：
LCD12864_ST7920			ATmega16
1.GND		--------	GND
2.VCC		--------	VCC
3.V0		--------	V0
4.RS(CS)	--------	VCC
5.R/W(SID)	--------	MOSI/PB5
6.E(SCLK)	--------	SCK/PB7
7.D0		--------	NC
8.D1		--------	NC
9.D2		--------	NC
10.D3		--------	NC
11.D4		--------	NC
12.D5		--------	NC
13.D6		--------	NC
14.D7		--------	NC
15.PSB		--------	GND
16.NC		--------	NC
17.RST		--------	NC
18.NC		--------	NC
19.LED+		--------	VCC
20.LED-		--------	GND

操作步骤：
(1)编译烧写该程序到ATmega16，断开电源
(2)若使用ISP接口烧写程序，请断开ISP烧写器
（由于本示例程序使用的是ATmega16的SPI接口，刚好是ISP烧写器的烧写口）
(3)将LCD12864_ST7920插入主板的Lcd12864插槽
(4)使用连接线将LCD12864_ST7920的以下引针接口连接到MCU：
（由于SMK1632已经做好了大部分的硬件连接，您只需连接以下数据端口）
LCD12864_ST7920			ATmega16
4.RS(CS)	--------	VCC
5.R/W(SID)	--------	MOSI/PB5
6.E(SCLK)	--------	SCK/PB7
15.PSB		--------	GND
(5)上电，如果操作正确，这时您可以看到显示的内容了

----------------------------------------------------------------------
注意事项：
（1）若有加载库函数，请将光盘根目录下的“库函数”下的“ICC_H”文件夹拷到D盘 
（2）请详细阅读：光盘根目录下的“产品资料\开发板实验板\SMK系列\SMK1632\说明资料”
----------------------------------------------------------------------
10101010101010101010101010101010101010101010101010101010101010101010*/

#include <iom16v.h>

#include "D:\ICC_H\LCD12864_ST7920.H"

/*--------------------------------------------------------------------
函数名称：
函数功能：
注意事项：
提示说明：
输    入：
返    回：
--------------------------------------------------------------------*/
void main()
{             
	SEI();
	lcd_init();
	lcd_puts(1,1,"  WaveShare.net");
	lcd_puts(3,1,"    微雪电子");
	while(1);
}