	.module OC2PWM.C
	.area text(rom, con, rel)
	.dbfile E:\微雪电子CD1\产品资料\开发板实验板\SMK系列\SMK1632\实验教程\内核及主板相关实验\内核－PWM\OC2PWM\OC2PWM.C
	.dbfunc e timer2_init _timer2_init fV
	.even
_timer2_init::
	.dbline -1
	.dbline 53
; /*********************************************************************
; 	微 雪 电 子   WaveShare   http://www.waveShare.net            	
; 		                                                        
; 目    的:   建立使用OC2做PWM的示例程序
; 	
; 目标系统:   基于AVR单片机
; 		                                                                
; 应用软件:   ICCAVR
; 		                                                                
; 版    本:   Version 1.0                                                          
; 		                                                                
; 圆版时间:   2005-06-25
; 	
; 开发人员:   SEE
; 
; 说    明:   若用于商业用途，请保留此段文字或注明代码来源
; 	
; 	深 圳 市 微 雪 电 子 有 限 公 司 保 留 所 有 的 版 权     
; *********************************************************************/
; 
; /*01010101010101010101010101010101010101010101010101010101010101010101
; ---------------------------------------------------------------------
; 版本更新记录：
; 
; ----------------------------------------------------------------------
; 实验内容：
; 使用UserLed作为PWM口的监控，如果PWM低速则可以观察到UserLed的闪烁。
; ----------------------------------------------------------------------
; 硬件连接：
; 将UserLed指示灯连接至PD7/OC2。
; ----------------------------------------------------------------------
; 注意事项： 
; （1）若有加载库函数，请将光盘根目录下的“库函数”下的“ICC_H”文件夹拷到D盘
; （2）请详细阅读：光盘根目录下的“产品资料\开发板实验板\SMK系列\SMK1632\说明资料”
; 		
; ----------------------------------------------------------------------
; 10101010101010101010101010101010101010101010101010101010101010101010*/
; 
; #include <iom16v.h> 
; #include <macros.h> 
; 
; #define OC2_OUT_EN	DDRD |= 0b10000000
; 
; /*--------------------------------------------------------------------
; 函数名称：
; 函数功能：
; 注意事项：
; 提示说明：
; 输    入：
; 返    回：
; --------------------------------------------------------------------*/
; void timer2_init(void) 
; { 
	.dbline 54
; 	TCCR2 = (1<<WGM21)|(1<<WGM20)|(1<<COM21)|(1<<COM20)|(1<<CS20);	
	ldi R24,121
	out 0x25,R24
	.dbline 60
; /*
; 	WGM21=1; WGM20=1; --> fast PWM modle
; 	COM21=1; COM20=0; --> 比较匹配时set OC2 pin
; 	CS20=1;  --> timer2 source 不经过任何分频，直接为Clk，使得PWM可以工作得足够快
; */
; 	TCNT2 = 0x00;			//设置TC2计数寄存器初值 
	clr R2
	out 0x24,R2
	.dbline 61
; 	OCR2  = 0xE0;			//输出比较寄存器初值，设置该值可用于调节占空比
	ldi R24,224
	out 0x23,R24
	.dbline -2
L1:
	.dbline 0 ; func end
	ret
	.dbend
	.dbfunc e main _main fV
	.even
_main::
	.dbline -1
	.dbline 72
; } 
; /*--------------------------------------------------------------------
; 函数名称：
; 函数功能：
; 注意事项：
; 提示说明：
; 输    入：
; 返    回：
; --------------------------------------------------------------------*/
; void main(void) 
; {
	.dbline 73
; 	OC2_OUT_EN;				//为允许PWM工作，需设置PD7为输出
	sbi 0x11,7
	.dbline 74
; 	timer2_init();
	xcall _timer2_init
	.dbline 75
; 	SEI(); 
	sei
L3:
	.dbline 76
L4:
	.dbline 76
	xjmp L3
X0:
	.dbline -2
L2:
	.dbline 0 ; func end
	ret
	.dbend
